/* Напишіть функцію, яка приймає рядкові дані і виконує перевірку на їх відповідність емейлу.
	Вимоги:
  Цифри (0-9).
  Тільки латинські літери в великому (A-Z) і малому (a-z) регістрах.
  В тілі емейла допустимі лишеі символи “_” і “-”. Але вони не можуть бути 1-им символом емейлу.
   Символ “-” не може повторюватися.

checkEmail('my_mail@gmail.com');
Email is correct!
checkEmail('#my_mail@gmail.com');
Email is not correct! */
function checkEmail (m){
 let re = /^([a-zA-Z0-9])+[_\|\-]{0,1}[a-zA-Z0-9]+[_\|\-]{0,1}[a-zA-Z0-9]+@{0,1}(([a-zA-Z0-9])+\.)+([a-zA-Z0-9]{2,6})+$/;
 console.log(re.test(m));
}


checkEmail('my__mail@gmail.com');